/**
 * @Date         : 2021-10-14 17:28:09
 * @Description  :
 * @Autor        : Qzr(z5021996@vip.qq.com)
 * @LastEditors  : Qzr(z5021996@vip.qq.com)
 * @LastEditTime : 2021-10-14 18:17:54
 */

/**
 * 常用正则
 */
export default {
  // 手机号验证
  phone: /^[1][3456789][0-9]{9}$/,

  // 身份证
  idCard: /^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/,

  // 邮箱
  email: /^([A-Za-z0-9_\-\.])+\@([A-Za-z0-9_\-\.])+\.([A-Za-z]{2,4})$/,

  // URL
  url: /^((https?|ftp|file):\/\/)?([\da-z\.-]+)\.([a-z\.]{2,6})([\/\w \.-]*)*\/?$/,

  // IPv4
  ipv4: /^(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$/,

  // 16进制颜色
  color16: /^#?([a-fA-F0-9]{6}|[a-fA-F0-9]{3})$/,

  // 日期YYYY-MM-DD
  date1: /^\d{4}(\-)\d{1,2}\1\d{1,2}$/,

  // 日期YYYY-MM-DD hh:mm:ss
  date2: /^(\d{1,4})(-|\/)(\d{1,2})\2(\d{1,2}) (\d{1,2}):(\d{1,2}):(\d{1,2})$/,

  // 整数
  int: /^[-+]?\d*$/,

  // 小数
  float: /^[-+]?\d*$/,

  // 邮政编码
  postalNo: /^\d{6}$/,

  // QQ号
  QQ: /^[1-9][0-9]{4,10}$/,

  // 微信号
  wx: /^[a-zA-Z]([-_a-zA-Z0-9]{5,19})+$/,

  // 车牌号
  carNo: /^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}[A-Z0-9]{4}[A-Z0-9挂学警港澳]{1}$/,

  // 只含字母的字符串
  letterStr: /^[a-zA-Z]+$/,

  // 包含中文的字符串
  cnStr: /[\u4E00-\u9FA5]/,

  // 密码强度 密码中必须包含字母、数字、特称字符，至少8个字符，最多30个字符
  password: /(?=.*[0-9])(?=.*[a-zA-Z])(?=.*[^a-zA-Z0-9]).{8,30}/,


}